Revit 2026 API
RebarCurvesData Class
 The class that contains the information needed to calculate and return the result of the external curve generation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarCurvesData
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RebarCurvesData : IDisposable
Public Class RebarCurvesData
	Implements IDisposable
public ref class RebarCurvesData : IDisposable
type RebarCurvesData =
    class
        interface IDisposable
    end
The RebarCurvesData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>)
CanAddBarGeometry
If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true.
ClearAllAddedBarGeometry |  This function will remove all bars geometry that were added by calling AddBarGeometry().
Dispose | Releases all resources used by the RebarCurvesData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAddedBarGeometry |  Gets the added curves that will represent the bar at index barIndex.
GetDistributionPath |  Gets the distribution path currently stored in the rebar.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetNumberOfBarGeometry |  Gets the number of Bar Geometry that were added.
GetRebarUpdateCurvesData |  Gets a class that contains information used as input and output for rebar free form calculation.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetDistributionPath
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace